src/toir_cf/src/Catalogs/торо_ПредопределенныеСценарииРаботыСистемы/торо_ПредопределенныеСценарииРаботыСистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ПредопределенныеСценарииРаботыСистемы</name>
  <predefined>
    <items>
      <name>ПаспортизацияОборудования</name>
      <description>Паспортизация оборудования</description>
    </items>
    <items>
      <name>ПолныйФункционал</name>
      <description>Полный функционал</description>
    </items>
  </predefined>
  <attributes>
    <name>торо_ИспользоватьСогласование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьУведомленияОСобытияхСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_УчетЗапчастей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьТиповыеОР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьКартинкиТиповыхОбъектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьСложныеТехКартыРемонтов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьНаправленияОР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьГарантии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьДокументыПринятияИСписанияОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьФункциональныеМеста</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_УчетКонтролируемыхПоказателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_УчетНаработкиОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_УчетСостоянияОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_УчетПусковОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_УчетВыявленныхДефектовОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьППР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_УчетЗамещающихРемонтов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьКоэффициентыРемонтныхОсобенностей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьРегламентныеМероприятия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьПланированиеПоЖесткимРемЦиклам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьЛимитыРемонтов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьОценкиРМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_РассчитыватьПлановуюСтоимостьРемонтовПриПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьЛоты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьСметыРемонта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьРемонтыПоСостоянию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьОбщийПланРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьВнешниеОснованияДляРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьНарядыНаВыполнениеРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьВозможностьОтменыРемонтов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьУсложненнуюСхемуЗакрытияНарядов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьАналогиНоменклатурыДляРемонтов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьУправлениеПерсоналом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьСтатусыДокументовТОиР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьКонтрольОтрицательныхОстатков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ВыделятьИнвестиционныеРемонты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьСтандартныеОповещенияОПревышенииПоказателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьУпрощеннуюФормуДефекта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьФоновыйРасчетППР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьОстановочныеРемонты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьНарядДопускНаРаботыПовышеннойОпасностиОбязательно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьОпасноеПроизводство</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ЗапретитьВводПотребленияБезАкта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ЗапретитьПроведениеАктовСИсполнителямиБезКвалификаций</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьАктПриемкиОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьНарядыНаРегламентноеМероприятие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ПоказыватьПодсистемуKPI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ЗапретитьРемонтГарантийногоОборудованияХозспособом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьХарактеристикиНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерииНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьВыгрузкуЗагрузкуMSProject</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИнтеграцияСПромБезопасностью</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ПоказыватьПодсистемуИнтеграцияАСУТП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_НапоминатьЗафиксироватьПростой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьПриоритетностьПеренесенныхРемонтов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьСкользящееПланирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_КонтролироватьВремяРаботыСотрудниковВАктах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ВводПотребленияНаОснованииПроведенногоАкта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ВводОприходованияНаОснованииПроведенногоАкта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_НазначениеНаРемонтСУчетомРисков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_НеПересчитыватьППРВФонеПослеОшибки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ЗапретитьВводЗаказовНаВнутреннееПотреблениеБезЗаявки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьКомиссии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_РасширенныйРежимМТО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИнтеграцияЗаказовСERP</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ЗапретитьПроведениеАктовБезВремениРаботыИсполнителей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьИнтеграциюСАИСДиспетчер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ЗапретитьПересечениеВремениРаботыСотрудниковСОдинаковойКвалификацией</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьАнализКоренныхПричин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_АвтоматическиОбновлятьПоставляемуюМодельПоказателейKPI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСинхронизациюДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьСинхронизациюСERP</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ВремяУчетаРецидивностиДефектов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьВремяУчетаРецидивностиДефектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_РазрешитьВводНесколькихСметПоРемонту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ВводЗаказовНаОснованииПроведенногоДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_УчитыватьСтатистикуПотребления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ПериодРасчетаСтатистикиПотребления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьНастраиваемыеПредставления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_РазрешитьПользовательскуюНастройкуПредставлений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьУтверждениеЗаказовНаВнутреннееПотребление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВводНаОсновании</name>
    <attributes>
      <name>ПараДокументов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cf/src/Enums/торо_ТипыОбъектовRCM/торо_ТипыОбъектовRCM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ТипыОбъектовRCM</name>
  <enumValues>
    <name>Объект</name>
  </enumValues>
  <enumValues>
    <name>ФункциональноеМесто</name>
  </enumValues>
  <enumValues>
    <name>Система</name>
  </enumValues>
</mdclass:Enum>

src/toir_cf/src/Catalogs/торо_ПредопределенныеСценарииРаботыСистемы/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КлючКОРПДоступен = Истина;
	Если НЕ слкМенеджерЗащитыСервер.СерияЗащитыИнициализирована("28DD", Истина) Тогда 
		КлючКОРПДоступен = Ложь;
		Если слкМенеджерЗащитыСервер.СерияЗащитыИнициализирована("5DD5", Истина) Тогда 
			НаборИмен = торо_СЛКСервер.ПолучитьНаборКонстантБлокируемыхВПРОФ();
			Для Каждого ИмяКонстанты Из НаборИмен Цикл
				Элемент = Элементы.Найти(ИмяКонстанты);
				Если Элемент <> Неопределено Тогда 
					Элемент.ТолькоПросмотр = Истина; 
					Элемент.Доступность = Ложь;
				КонецЕсли;
			КонецЦикла;
		Иначе
			ЭтаФорма.ТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДосутпностьЭлементов();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура торо_ИспользоватьТиповыеОРПриИзменении(Элемент)
	
	Элементы.торо_ИспользоватьКартинкиТиповыхОбъектов.Доступность = Объект.торо_ИспользоватьТиповыеОР;
	
	Если НЕ Объект.торо_ИспользоватьТиповыеОР Тогда 
		Объект.торо_ИспользоватьКартинкиТиповыхОбъектов = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура торо_ИспользоватьГарантииПриИзменении(Элемент)
	
	Элементы.торо_ЗапретитьРемонтГарантийногоОборудованияХозспособом.Доступность = Объект.торо_ИспользоватьГарантии;
	
	Если НЕ Объект.торо_ИспользоватьГарантии Тогда 
		Объект.торо_ЗапретитьРемонтГарантийногоОборудованияХозспособом = Ложь;		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура торо_ИспользоватьФункциональныеМестаПриИзменении(Элемент)

	Если НЕ Объект.торо_ИспользоватьФункциональныеМеста Тогда
		ЕстьФМ = ПроверитьНаличиеФМ();
		Если ЕстьФМ Тогда 
			Объект.торо_ИспользоватьФункциональныеМеста = Истина;
			ТекстСообщения = НСтр("ru = 'Нельзя изменить настройку, пока в системе есть объекты с типом функциональное место!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура торо_УчетКонтролируемыхПоказателейПриИзменении(Элемент)
	
	Элементы.торо_ИспользоватьРемонтыПоСостоянию.Доступность = Объект.торо_УчетКонтролируемыхПоказателей;
	Элементы.торо_ИспользоватьСтандартныеОповещенияОПревышенииПоказателей.Доступность = Объект.торо_УчетКонтролируемыхПоказателей;
	
	Если НЕ Объект.торо_УчетКонтролируемыхПоказателей Тогда 
		Объект.торо_ИспользоватьРемонтыПоСостоянию = Ложь;
		Объект.торо_ИспользоватьСтандартныеОповещенияОПревышенииПоказателей = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура торо_УчетСостоянияОборудованияПриИзменении(Элемент)
	
	Элементы.торо_УчетПусковОборудования.Доступность = Объект.торо_УчетСостоянияОборудования;
	Элементы.торо_НапоминатьЗафиксироватьПростой.Доступность = Объект.торо_УчетСостоянияОборудования;
	
	Если НЕ Объект.торо_УчетСостоянияОборудования Тогда 
		Объект.торо_УчетПусковОборудования = Ложь;
		Объект.торо_НапоминатьЗафиксироватьПростой = Ложь;
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура торо_УчетВыявленныхДефектовОборудованияПриИзменении(Элемент)
	
	Элементы.торо_ИспользоватьУпрощеннуюФормуДефекта.Доступность = Объект.торо_УчетВыявленныхДефектовОборудования;
	Элементы.торо_НазначениеНаРемонтСУчетомРисков.Доступность = Объект.торо_УчетВыявленныхДефектовОборудования;
	Элементы.торо_ИспользоватьАнализКоренныхПричин.Доступность = Объект.торо_УчетВыявленныхДефектовОборудования;
	
	Если НЕ Объект.торо_УчетВыявленныхДефектовОборудования Тогда 
		Объект.торо_ИспользоватьУпрощеннуюФормуДефекта = Ложь;
		Объект.торо_НазначениеНаРемонтСУчетомРисков = Ложь;
		Объект.торо_ИспользоватьАнализКоренныхПричин = Ложь;
		Объект.торо_ИспользоватьВремяУчетаРецидивностиДефектов = Ложь;
		
		Элементы.торо_ВремяУчетаРецидивностиДефектов.Доступность = Ложь;
		Элементы.торо_ИспользоватьВремяУчетаРецидивностиДефектов.Доступность = Ложь;
	Иначе
		Элементы.торо_ВремяУчетаРецидивностиДефектов.Доступность = Ложь;
		Элементы.торо_ИспользоватьВремяУчетаРецидивностиДефектов.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура торо_ИспользоватьППРПриИзменении(Элемент)
	 	
	Элементы.торо_ИспользоватьФоновыйРасчетППР.Доступность = Объект.торо_ИспользоватьППР;
	
	Если НЕ Объект.торо_ИспользоватьППР Тогда 
		Объект.торо_ИспользоватьФоновыйРасчетППР = Ложь;
		Объект.торо_НеПересчитыватьППРВФонеПослеОшибки = Ложь;
		Элементы.торо_НеПересчитыватьППРВФонеПослеОшибки.Доступность = Объект.торо_ИспользоватьФоновыйРасчетППР;
	КонецЕсли;
	
	ПроверитьВключитьУчетСостояний();
			
КонецПроцедуры

&НаКлиенте
Процедура торо_ИспользоватьФоновыйРасчетППРПриИзменении(Элемент)
	
	Элементы.торо_НеПересчитыватьППРВФонеПослеОшибки.Доступность = Объект.торо_ИспользоватьФоновыйРасчетППР;
	Если НЕ Объект.торо_ИспользоватьФоновыйРасчетППР Тогда
		Объект.торо_НеПересчитыватьППРВФонеПослеОшибки = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура торо_ИспользованиеЛимитовРемонтовПриИзменении(Элемент)
	
	Элементы.торо_ИспользоватьОценкиРМ.Доступность = Объект.торо_ИспользоватьЛимитыРемонтов;
	
	Если НЕ Объект.торо_ИспользоватьЛимитыРемонтов Тогда 
		Объект.торо_ИспользоватьОценкиРМ = Ложь;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура торо_ИспользоватьНарядыНаВыполнениеРаботПриИзменении(Элемент)
	
	Элементы.торо_ИспользоватьНарядДопускНаРаботыПовышеннойОпасностиОбязательно.Доступность = Объект.торо_ИспользоватьНарядыНаВыполнениеРабот;
	
	Если НЕ Объект.торо_ИспользоватьНарядыНаВыполнениеРабот Тогда 
		Объект.торо_ИспользоватьНарядДопускНаРаботыПовышеннойОпасностиОбязательно = Ложь;
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура торо_ПоказыватьПодсистемуKPIПриИзменении(Элемент)
	Элементы.торо_АвтоматическиОбновлятьПоставляемуюМодельПоказателейKPI.Доступность = Объект.торо_ПоказыватьПодсистемуKPI;
	Если Не Объект.торо_ПоказыватьПодсистемуKPI Тогда
		Объект.торо_АвтоматическиОбновлятьПоставляемуюМодельПоказателейKPI = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСинхронизациюДанныхПриИзменении(Элемент)
	
	Если НЕ Объект.ИспользоватьСинхронизациюДанных Тогда
		Объект.торо_ИспользоватьСинхронизациюСERP = Ложь;
	КонецЕсли; 
	
	Если НЕ Объект.торо_РасширенныйРежимМТО ИЛИ НЕ Объект.ИспользоватьСинхронизациюДанных Тогда
		Объект.торо_ИнтеграцияЗаказовСERP = Ложь;
	КонецЕсли;
	
	Элементы.торо_ИспользоватьСинхронизациюСERP.Доступность = Объект.ИспользоватьСинхронизациюДанных И КлючКОРПДоступен;
	Элементы.торо_ИнтеграцияЗаказовСERP.Доступность = Объект.торо_РасширенныйРежимМТО И Объект.ИспользоватьСинхронизациюДанных;
	
КонецПроцедуры

&НаКлиенте
Процедура торо_РасширенныйРежимМТОПриИзменении(Элемент)
	
	Если НЕ Объект.торо_РасширенныйРежимМТО ИЛИ НЕ Объект.ИспользоватьСинхронизациюДанных Тогда
		Объект.торо_ИнтеграцияЗаказовСERP = Ложь;
	КонецЕсли;

	Элементы.торо_ИнтеграцияЗаказовСERP.Доступность = Объект.торо_РасширенныйРежимМТО И Объект.ИспользоватьСинхронизациюДанных;

КонецПроцедуры

&НаКлиенте
Процедура торо_ИспользоватьВремяУчетаРецидивностиДефектовПриИзменении(Элемент)
	Элементы.торо_ВремяУчетаРецидивностиДефектов.Доступность = Объект.торо_ИспользоватьВремяУчетаРецидивностиДефектов;
КонецПроцедуры

&НаКлиенте
Процедура торо_ИспользоватьОбщийПланРаботПриИзменении(Элемент)
	Если Не Объект.торо_ИспользоватьОбщийПланРабот Тогда
		Элементы.Группа13.Доступность = Ложь;
		Объект.торо_ИспользоватьСкользящееПланирование = Ложь;
	Иначе
		Элементы.Группа13.Доступность = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура торо_ИспользоватьСметыРемонтаПриИзменении(Элемент)
	Элементы.торо_РазрешитьВводНесколькихСметПоРемонту.Доступность = Объект.торо_ИспользоватьСметыРемонта;
	
	Если Не Объект.торо_ИспользоватьСметыРемонта Тогда
		Объект.торо_РазрешитьВводНесколькихСметПоРемонту = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура торо_УчитыватьСтатистикуПотребленияПриИзменении(Элемент)
	
	Если Объект.торо_УчитыватьСтатистикуПотребления = Истина И Объект.торо_ПериодРасчетаСтатистикиПотребления = 0 Тогда
		Объект.торо_ПериодРасчетаСтатистикиПотребления = 5;
	КонецЕсли;
	
	Элементы.торо_ПериодРасчетаСтатистикиПотребления.Доступность = Объект.торо_УчитыватьСтатистикуПотребления;
КонецПроцедуры

&НаКлиенте
Процедура торо_ИспользоватьНастраиваемыеПредставленияПриИзменении(Элемент)   
	
	Если НЕ Объект.торо_ИспользоватьНастраиваемыеПредставления Тогда
		Объект.торо_РазрешитьПользовательскуюНастройкуПредставлений = Ложь;
	КонецЕсли;
	
	Элементы.торо_РазрешитьПользовательскуюНастройкуПредставлений.Доступность = Объект.торо_ИспользоватьНастраиваемыеПредставления;
	
КонецПроцедуры

&НаКлиенте
Процедура торо_УчетНаработкиОборудованияПриИзменении(Элемент)

	ПроверитьВключитьУчетСостояний();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте 
Процедура УстановитьДосутпностьЭлементов()
	
	Элементы.торо_ЗапретитьРемонтГарантийногоОборудованияХозспособом.Доступность            = Объект.торо_ИспользоватьГарантии;
	Элементы.торо_ИспользоватьКартинкиТиповыхОбъектов.Доступность                           = Объект.торо_ИспользоватьТиповыеОР;
	Элементы.торо_ИспользоватьРемонтыПоСостоянию.Доступность                                = Объект.торо_УчетКонтролируемыхПоказателей;
	Элементы.торо_ИспользоватьСтандартныеОповещенияОПревышенииПоказателей.Доступность       = Объект.торо_УчетКонтролируемыхПоказателей;
	Элементы.торо_ИспользоватьУпрощеннуюФормуДефекта.Доступность                            = Объект.торо_УчетВыявленныхДефектовОборудования;
	Элементы.торо_НазначениеНаРемонтСУчетомРисков.Доступность 								= Объект.торо_УчетВыявленныхДефектовОборудования;
	Элементы.торо_ИспользоватьАнализКоренныхПричин.Доступность 								= Объект.торо_УчетВыявленныхДефектовОборудования;
	Элементы.торо_ИспользоватьФоновыйРасчетППР.Доступность                                  = Объект.торо_ИспользоватьППР;
	Элементы.торо_НеПересчитыватьППРВФонеПослеОшибки.Доступность 							= Объект.торо_ИспользоватьФоновыйРасчетППР;
	Элементы.торо_ИспользоватьОценкиРМ.Доступность                                          = Объект.торо_ИспользоватьЛимитыРемонтов;
	Элементы.торо_ИспользоватьНарядДопускНаРаботыПовышеннойОпасностиОбязательно.Доступность = Объект.торо_ИспользоватьНарядыНаВыполнениеРабот;
	Элементы.торо_АвтоматическиОбновлятьПоставляемуюМодельПоказателейKPI.Доступность	    = Объект.торо_ПоказыватьПодсистемуKPI;
	Элементы.торо_ПериодРасчетаСтатистикиПотребления.Доступность							= Объект.торо_УчитыватьСтатистикуПотребления;
	Элементы.торо_ИспользоватьСинхронизациюСERP.Доступность                                 = Объект.ИспользоватьСинхронизациюДанных;
	Элементы.торо_ИнтеграцияЗаказовСERP.Доступность                                         = Объект.торо_РасширенныйРежимМТО И Объект.ИспользоватьСинхронизациюДанных;
	Элементы.торо_ИспользоватьВремяУчетаРецидивностиДефектов.Доступность                    = Объект.торо_УчетНаработкиОборудования;
	Элементы.торо_ВремяУчетаРецидивностиДефектов.Доступность                                = Объект.торо_ИспользоватьВремяУчетаРецидивностиДефектов;
	Элементы.торо_РазрешитьВводНесколькихСметПоРемонту.Доступность                          = Объект.торо_ИспользоватьСметыРемонта;
	Элементы.торо_РазрешитьПользовательскуюНастройкуПредставлений.Доступность               = Объект.торо_ИспользоватьНастраиваемыеПредставления;
	
	Если Не Объект.торо_ИспользоватьОбщийПланРабот Тогда
		Элементы.Группа13.Доступность = Ложь;
		Объект.торо_ИспользоватьСкользящееПланирование = Ложь;
	Иначе
		Элементы.Группа13.Доступность = Истина;
	КонецЕсли;	
	
	УстановитьВидимостьДоступностьУчетСостояний();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВключитьУчетСостояний()
	
	Если Объект.торо_УчетНаработкиОборудования И Объект.торо_ИспользоватьППР Тогда
		Объект.торо_УчетСостоянияОборудования = Истина;
	КонецЕсли;
	
	УстановитьВидимостьДоступностьУчетСостояний();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступностьУчетСостояний()
	
	УчетСостоянийОбязателен = Объект.торо_УчетНаработкиОборудования И Объект.торо_ИспользоватьППР;
	Элементы.торо_УчетСостоянияОборудования.Доступность = НЕ УчетСостоянийОбязателен;
	Элементы.торо_УчетПусковОборудования.Доступность = Объект.торо_УчетСостоянияОборудования;
	Элементы.торо_НапоминатьЗафиксироватьПростой.Доступность = Объект.торо_УчетСостоянияОборудования;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьНаличиеФМ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ОбъектыРемонта.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	               |ГДЕ
	               |	торо_ОбъектыРемонта.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто)
	               |	И НЕ торо_ОбъектыРемонта.ПометкаУдаления
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	торо_ТиповыеОР.Ссылка
	               |ИЗ
	               |	Справочник.торо_ТиповыеОР КАК торо_ТиповыеОР
	               |ГДЕ
	               |	торо_ТиповыеОР.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто)
	               |	И НЕ торо_ТиповыеОР.ПометкаУдаления";
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда 
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти
